libopencm3/libopencm3/include/libopencm3/ethernet/mac_stm32fxx7.h
/*---------------------------------------------------------------------------*/
/* MACA1HR, MACA2HR, MACA3HR ------------------------------------------------*/

#define ETH_MACAHR_MACAH		(0xFFFF<<0)
#define ETH_MACAHR_MBC_ALL		(63<<24)
#define ETH_MACAHR_MBC_0		(1<<24)
#define ETH_MACAHR_MBC_1		(1<<25)
#define ETH_MACAHR_MBC_2		(1<<26)
#define ETH_MACAHR_MBC_3		(1<<27)
#define ETH_MACAHR_MBC_4		(1<<28)
#define ETH_MACAHR_MBC_5		(1<<29)
#define ETH_MACAHR_SA			(1<<30)
#define ETH_MACAHR_AE			(1<<31)

/*---------------------------------------------------------------------------*/
/* MMCCR --------------------------------------------------------------------*/

#define ETH_MMCCR_CR			(1<<0)
#define ETH_MMCCR_CSR			(1<<1)
#define ETH_MMCCR_ROR			(1<<2)
#define ETH_MMCCR_MCF			(1<<3)
/* Following registers not available on F1 */
#if !defined(STM32F1)
	#define ETH_MMCCR_MCP			(1<<4)
	#define ETH_MMCCR_MCFHP			(1<<5)
#endif

/*---------------------------------------------------------------------------*/
/* MMCRIR -------------------------------------------------------------------*/

#define ETH_MMCRIR_RFCES		(1<<5)
#define ETH_MMCRIR_RFAES		(1<<6)
#define ETH_MMCRIR_RGUFS		(1<<17)

/*---------------------------------------------------------------------------*/
/* MMCTIR -------------------------------------------------------------------*/

#define ETH_MMCTIR_TGFSCS		(1<<14)
#define ETH_MMCTIR_TGFMSCS		(1<<15)
#define ETH_MMCTIR_TGFS			(1<<21)

/*---------------------------------------------------------------------------*/
/* MMCRIMR ------------------------------------------------------------------*/

#define ETH_MMCRIMR_RFCEM		(1<<5)
#define ETH_MMCRIMR_RFAEM		(1<<6)
#define ETH_MMCRIMR_RGUFM		(1<<17)

/*---------------------------------------------------------------------------*/
/* MMCTIMR ------------------------------------------------------------------*/

#define ETH_MMCTIMR_TGFSCS		(1<<14)
#define ETH_MMCTIMR_TGFMSCS		(1<<15)
#define ETH_MMCTIMR_TGFS		(1<<21)

/*---------------------------------------------------------------------------*/
/* PTPTSCR ------------------------------------------------------------------*/

#define ETH_PTPTSCR_TSE			(1<<0)
#define ETH_PTPTSCR_TSFCU		(1<<1)
#define ETH_PTPTSCR_TSSTI		(1<<2)
#define ETH_PTPTSCR_TSSTU		(1<<3)
#define ETH_PTPTSCR_TSITE		(1<<4)
#define ETH_PTPTSCR_TTSARU		(1<<5)

/* Following registers not available on F1 */
#if !defined(STM32F1)
	#define ETH_PTPTSCR_TSSARFE		(1<<8)
	#define ETH_PTPTSCR_TSSSR		(1<<9)
	#define ETH_PTPTSCR_TSPTPPSV2E		(1<<10)
	#define ETH_PTPTSCR_TSSPTPOEFE		(1<<11)
	#define ETH_PTPTSCR_TSSIPV6FE		(1<<12)
	#define ETH_PTPTSCR_TSSIPV4FE		(1<<13)
	#define ETH_PTPTSCR_TSSEME		(1<<14)
	#define ETH_PTPTSCR_TSSMRME		(1<<15)

	#define ETH_PTPTSCR_TSCNT_SHIFT		16
	#define ETH_PTPTSCR_TSCNT		(3 << ETH_PTPTSCR_TSCNT_SHIFT)
	#define ETH_PTPTSCR_TSCNT_ORD		(0 << ETH_PTPTSCR_TSCNT_SHIFT)
	#define ETH_PTPTSCR_TSCNT_BOUND		(1 << ETH_PTPTSCR_TSCNT_SHIFT)
	#define ETH_PTPTSCR_TSCNT_ETETC		(2 << ETH_PTPTSCR_TSCNT_SHIFT)
	#define ETH_PTPTSCR_TSCNT_PTPTC		(3 << ETH_PTPTSCR_TSCNT_SHIFT)

	#define ETH_PTPTSCR_TSPFFMAE		(1<<18)
#endif


/*---------------------------------------------------------------------------*/
/* PTPSSIR ------------------------------------------------------------------*/

#define ETH_PTPSSIR_STSSI		0xFF

/*---------------------------------------------------------------------------*/
/* PTPTSLR ------------------------------------------------------------------*/

#define ETH_PTPTSLR_STSS		0x7FFFFFFF
#define ETH_PTPTSLR_STPNS		(1<<31)

/*---------------------------------------------------------------------------*/
/* PTPTSLUR -----------------------------------------------------------------*/

#define ETH_PTPTSLUR_TSUSS		0x7FFFFFFF
#define ETH_PTPTSLUR_TSUPNS		(1<<31)

/*---------------------------------------------------------------------------*/
/* PTPTSSR ------------------------------------------------------------------*/

/* Following registers not available on F1 */
#if !defined(STM32F1)
	#define ETH_PTPTSSR_TSSO		(1<<0)
	#define ETH_PTPTSSR_TSTTR		(1<<1)
#endif

/*---------------------------------------------------------------------------*/
/* PTPPPSCR -----------------------------------------------------------------*/

/* Following registers not available on F1 */
#if !defined(STM32F1)
	#define ETH_PTPPPSCR_PPSFREQ				(0x0F<<0)
	#define ETH_PTPPPSCR_PPSFREQ_1HZ			(0x00<<0)
	#define ETH_PTPPPSCR_PPSFREQ_2HZ			(0x01<<0)
	#define ETH_PTPPPSCR_PPSFREQ_4HZ			(0x02<<0)
	#define ETH_PTPPPSCR_PPSFREQ_8HZ			(0x03<<0)
	#define ETH_PTPPPSCR_PPSFREQ_16HZ			(0x04<<0)
	#define ETH_PTPPPSCR_PPSFREQ_32HZ			(0x05<<0)
	#define ETH_PTPPPSCR_PPSFREQ_64HZ			(0x06<<0)
	#define ETH_PTPPPSCR_PPSFREQ_128HZ			(0x07<<0)
	#define ETH_PTPPPSCR_PPSFREQ_256HZ			(0x08<<0)
	#define ETH_PTPPPSCR_PPSFREQ_512HZ			(0x09<<0)
	#define ETH_PTPPPSCR_PPSFREQ_1024HZ			(0x0A<<0)
	#define ETH_PTPPPSCR_PPSFREQ_2048HZ			(0x0B<<0)
	#define ETH_PTPPPSCR_PPSFREQ_4096HZ			(0x0C<<0)
	#define ETH_PTPPPSCR_PPSFREQ_8192HZ			(0x0D<<0)
	#define ETH_PTPPPSCR_PPSFREQ_16384HZ		(0x0E<<0)
	#define ETH_PTPPPSCR_PPSFREQ_32768HZ		(0x0F<<0)
#endif

/*---------------------------------------------------------------------------*/
/* DMABMR -------------------------------------------------------------------*/

#define ETH_DMABMR_SR			(1<<0)
#define ETH_DMABMR_DA			(1<<1)

#define ETH_DMABMR_DSL_SHIFT		2
#define ETH_DMABMR_DSL			(0x1F << ETH_DMABR_DSL_SHIFT)

#define ETH_DMABMR_EDFE			(1<<7)

#define ETH_DMABMR_PBL_SHIFT		8
#define ETH_DMABMR_PBL			(0x3F << ETH_DMABR_PBL_SHIFT)

#define ETH_DMABMR_PM_SHIFT		14
#define ETH_DMABMR_PM			(0x03 << ETH_DMABMR_PM_SHIFT)
#define ETH_DMABMR_PM_1_1		(0 << ETH_DMABMR_PM_SHIFT)
#define ETH_DMABMR_PM_2_1		(1 << ETH_DMABMR_PM_SHIFT)
#define ETH_DMABMR_PM_3_1		(2 << ETH_DMABMR_PM_SHIFT)
#define ETH_DMABMR_PM_4_1		(3 << ETH_DMABMR_PM_SHIFT)

#define ETH_DMABMR_FB			(1<<16)

#define ETH_DMABMR_RDP_SHIFT		17
#define ETH_DMABMR_RDP			(0x3F << ETH_DMABMR_RDP_SHIFT)

#define ETH_DMABMR_USP			(1<<23)
#define ETH_DMABMR_FPM			(1<<24)
#define ETH_DMABMR_AAB			(1<<25)
/* Following registers not available on F1 */
#if !defined(STM32F1)
	#define ETH_DMABMR_MB			(1<<26)
#endif

